export const state = {
  name: 'Егор', sex: 'm', age: 25, h: 178, w: 63, wg: 70, act: 1.55, goal: 'gain',
  units: 'metric', notif: true, fx: true,
  goalKcal: 0, gP: 0, gC: 0, gF: 0,
  meals: { 'Завтрак': [], 'Обед': [], 'Ужин': [], 'Перекусы': [] },
  workouts: [],
  weightLogs: [],
  normHistory: [],
  _celebrated: false
}

export const WDB = [
  ['Бег', '🏃', 11], ['Тренажёрный зал', '🏋️', 7], ['Велосипед', '🚴', 8],
  ['Плавание', '🏊', 9], ['HIIT / кроссфит', '🔥', 13], ['Футбол', '⚽', 9],
  ['Ходьба', '🚶', 4], ['Йога / растяжка', '🧘', 3]
]

export const DB = [
  ['Куриная грудка', 165, 31, 0, 3.6], ['Рис варёный', 130, 2.7, 28, 0.3],
  ['Гречка варёная', 110, 4, 21, 1.1], ['Творог 5%', 121, 16, 3, 5],
  ['Яйцо (1 шт ~60г)', 78, 6.3, 0.4, 5.3], ['Банан', 96, 1.5, 21, 0.2],
  ['Овсянка на воде', 88, 3, 15, 1.7], ['Лосось', 208, 20, 0, 13],
  ['Греческий йогурт', 59, 10, 3.6, 0.4], ['Авокадо', 160, 2, 9, 15],
  ['Цельнозерновой хлеб', 247, 9, 41, 3.4], ['Орехи грецкие', 654, 15, 14, 65],
  ['Говядина отварная', 254, 28, 0, 16], ['Картофель варёный', 82, 2, 17, 0.4],
  ['Протеиновый коктейль', 120, 24, 3, 1.5]
]
